show tables;

create table member(
	idx int not null auto_increment primary key,  -- 회원고유번호
	name varchar(20) not null, 					  -- 성명
	nickName varchar(40) not null, 				  -- 닉네임
	email varchar(50) not null,					  -- 이메일주소
	age int not null,							  -- 나이
	password int not null,						  -- 패스워드
	phoneNum varchar(20) not null				  -- 전화번호
);

insert into member values (default, '성명', 'admin', '이메일', 20, 1234, '전화번호');

desc member;

select * from member;

create table travelList(
	area varchar(20) not null,		-- 지역 이름
	name varchar(20) not null,		-- 여행지 이름
	address varchar(50) not null, 	-- 여행지 주소
	hashTag1 varchar(20) not null, 	-- 실내/실외
	hashTag2 varchar(20) not null, 	-- 해쉬태그
	foodf varchar(20) not null,		-- 음식점1
	foodfK varchar(20) not null, 	-- 음식점1의 종류
	foods varchar(20) not null,		-- 음식점2
	foodsK varchar(20) not null, 	-- 음식점2의 종류
	foodt varchar(20) not null,		-- 음식점3
	foodtK varchar(20) not null 	-- 음식점3의 종류
);


-- drop table travelList;

-- 강원도
insert into travelList values('강원도','남이섬', '강원 춘천시 남산면 남이섬길1','실외','산책','딴지펍','양식','차담','카페','고목','브런치');
insert into travelList values('강원도','대관령양떼목장','강원 평창군 대관령면 대관령마루길 483-32','실외','체험','타샤의 언덕','카페','유명찐빵','찐빵','수미카페','베이커리');
insert into travelList values('강원도','고석정꽃밭','강원 철원군 동송읍 태봉로 1769','실외','산책','카페 프로방스','카페','어랑손만두국','만두','카페주상절리','카페');
insert into travelList values('강원도','경포해변','강원 강릉시 강문동 산1','실외','바닷가','호라이즌앳20','뷔페','연주포차','포장마차','톰스비스트로','양식');
insert into travelList values('강원도','설악 케이블카','강원 속초시 설악산로 1085','실외','케이블카','설악다향','카페','케이블카스낵코너','푸드코트','커피방하착','카페');
insert into travelList values('강원도','오션월드','강원 홍천군 서면 한치골길 262','실외','워터파크','더엠브로시아','카페','동해횟집','일식당','셰프스키친','뷔페');
insert into travelList values('강원도','별마로천문대','강원 영월군 영월읍 천문대길 397','실내','체험','이가닭강정','치킨','영월소금빵','베이커리','살롱드림','양식');
insert into travelList values('강원도','하슬라아트월드','강원 강릉시 강동면 율곡로 1441','실내','테마공원','장레스토랑','양식','스테이인터뷰','카페','썬카페','카페');
insert into travelList values('강원도','제이드가든','강원 춘천시 남산면 햇골길 80','실외','수목원','살롱제이드','카페','햇골길 34','카페','월송유로','베이커리');
insert into travelList values('강원도','토왕성폭포','강원 속초시 설악동','실외','폭포','켈싱턴호텔 설악점','양식','애비로드','카페','설악다향','카페');

-- 경기도
insert into travelList values('경기도','화담숲','경기 광주시 도척면 도첫윗로 278-1','실외','수목원','번지없는 주막','포장마차','화담숲카페','카페','카페테리아','양식');
insert into travelList values('경기도','한국민속촌','경기 용인시 기흥구 민속촌로 90','실외','체험','와식당','일식당','에브리데이','베이커리','바소','양식');
insert into travelList values('경기도','아침고요수목원','경기 가평군 상면 수목원로 432','실외','수목원','도넛하우스','베이커리','LEBOL','카페','구름산','카페');
insert into travelList values('경기도','탄도항','경기 안산시 단원구 선감동 717-5','실외','바닷가','아모르','카페','해솔카페','카페','메이플라워','카페');
insert into travelList values('경기도','농협경계지주 안성팜랜드','경기 안성시 공도읍 대신두길 28','실외','체험','올드타임','양식','금화왕','베이커리','아메리카나','카페');
insert into travelList values('경기도','미사경정공원','경기 하남시 미사동 15','실외','산책','소진담컬쳐','카페','소진담','베이커리','마이가든 미사','브런치');
insert into travelList values('경기도','서울대공원','경기 과천시 대공원광장로 102','실외','산책','기린스낵코너','푸드코트','라운지디','양식','쉼표','카페');
insert into travelList values('경기도','광명동굴','경기 광명시 가학로 85번길 142','실외','동굴','광명동굴','카페','광명 스낵코너','푸드코트','크레이저','카페');
insert into travelList values('경기도','국립과천과학관','경기 과천시 상하벌로 110','실내','체험','쉼터','포장마차','빵명장','베이커리','Apmadang','카페');
insert into travelList values('경기도','포천아트밸리','경기 포천시 신복면 아트밸리로 234','실외','관람','빵명장','베이커리','프롬스톤','카페','어느덧오늘','브런치');

-- 경상남도
insert into travelList values('경상남도','지리산','경남 함양군 마천면 추성리','실외','산책','카페중산리','카페','지리산중','베이커리','산중 스낵코너','푸드코트');
insert into travelList values('경상남도','황산공원','경남 양산시 물금읍 물금리 162-1','실외','산책','블랙업커피','카페','디저트무이','베이커리','로얄경양식','양식');
insert into travelList values('경상남도','거제식물원','경남 거제시 거제면 거제남서로 3595','실내','식물원','식물원 옆','베이커리','더외칸카페','카페','이디야커피','카페');
insert into travelList values('경상남도','아라마루 아쿠아리움','경남 사천시 사천대로 18','실내','아쿠아리움','카페아쿠아','카페','더웨이닝','베이커리','삼천포대교','카페');
insert into travelList values('경상남도','통영케이블카','경남 통영시 발개로 205','실외','케이블카','코카모메','일식당','영영','카페','오늘도','베이커리');
insert into travelList values('경상남도','가야랜드','경남 김해시 인제로 368','실외','테마공원','루반커피','카페','루븐','디저트','포레스트','베이커리');
insert into travelList values('경상남도','김해연지공원','경남 김해시 내동 106-1','실외','산책','빌라드구산','카페','스시야마','일식당','슬라디','베이커리');
insert into travelList values('경상남도','로봇랜드','경남 창원시 마산합포구 구산면 로봇랜드로 250','실외','테마공원','심리카페','카페','섬섬','베이커리','플라야카페','베이커리');
insert into travelList values('경상남도','무진정','경남 함안군 함안면 괴산리','실외','산책','무진카페','카페','식목일카페','베이커리','하만스','양식');
insert into travelList values('경상남도','고성공룡박물관','경남 고성군 하이면 자란만로 618','실내','체험','듕가리','카페','가마랑카페','카페','리포스','베이커리');

-- 경상북도
insert into travelList values('경상북도','동궁과 월지','경북 경주시 원화로 102 안압지','실외','산책','유명찰보리','베이커리','마노','카페','첨성로179','베이커리');
insert into travelList values('경상북도','첨성대','경북 경주시 인왕동 839-1','실외','관람','제이커피','카페','경주십원빵','베이커리','이상복명과','베이커리');
insert into travelList values('경상북도','월영교','경북 안동시 상아동 569','실외','산책','핸즈커피','카페','라라룬','베이커리','월영교달빵','베이커리');
insert into travelList values('경상북도','부석사','경북 영주시 부석면 부석사로 345','실외','산책','가로수','카페','카페317','카페','무량수','베이커리');
insert into travelList values('경상북도','경주월드','경북 경주시 보문로 544','실외','테마공원','컵넛','카페','도미노미','양식','월드영','베이커리');
insert into travelList values('경상북도','칠포해수욕장','경북 포항시 북구 흥해읍','실외','바닷가','두낫디스터브','카페','카페포토피아','카페','린도','베이커리');
insert into travelList values('경상북도','국립경주박물관','경북 경주시 일정로 186 국립경주박물관','실내','관람','이디야커피','카페','브라운슈가','카페','오슬로','베이커리');
insert into travelList values('경상북도','석굴암','경북 경주시 석굴로 238','실외','산책','메이플','카페','이상복명과','베이커리','내류사카페','베이커리');
insert into travelList values('경상북도','안동하회마을','경북 안동시 풍천면 전서로 186','실외','산책','탈빙고카페','카페','시월애','베이커리','더뷰','카페');
insert into travelList values('경상북도','낙동강체육공원','경북 구미시 낙동제방길 200','실외','산책','카페둑','카페','미미케이크','베이커리','스윗세븐어클락','베이커리');

-- 전라남도
insert into travelList values('전라남도','순천만국가정원','전남 순천시 국가정원1호길 47','실외','관람','힐링','카페','프랑스정원','베이커리','정원순천','카페');
insert into travelList values('전라남도','오동도','전남 여수시 수정동 산1-11','실외','관람','동박새꿈정원','카페','카멜리아','카페','소노캄','베이커리');
insert into travelList values('전라남도','여수해상케이블카','전남 여수시 돌산읍 돌산로 3600-1','실외','케이블카','하얀파도','베이커리','스타벅스','카페','이디야커피','카페');
insert into travelList values('전라남도','아쿠아플라넷 여수','전남 여수시 오동도로 61-11 아쿠아리움','실내','아쿠아리움','여수딸기모찌','베이커리','탐앤탐스','카페','신라스테이','뷔페');
insert into travelList values('전라남도','섬진강기차마을','전남 곡성군 오곡면 기차마을로 232','실외','테마공원','기찻길','카페','B.s coffee','카페','라이첸','베이커리');
insert into travelList values('전라남도','순천만습지','전남 순천시 순천만길 513-25','실외','산책','순천만쉼터','카페','엔제리너스','카페','아슈끌림','디저트');
insert into travelList values('전라남도','대흥사','전남 해남군 대흥사길 400','실외','산책','카페유선','카페','레이크하우스','뷔페','하우스레스토랑','양식');
insert into travelList values('전라남도','목포해상케이블카','전남 목포시 해양대학로 240','실외','케이블카','유달유업','카페','미락','양식','봄날카페','베이커리');
insert into travelList values('전라남도','여수 유월드 루지 테마파크','전남 여수시 소라면 안심산길 155','실외','체험','힐론','카페','더올리브','양식','다이닝','베이커리');
insert into travelList values('전라남도','담양관방제림','전남 담양군 담양읍 객사7길 37','실외','산책','김순옥댓입','베이커리','쿠잉롤카페','베이커리','대담카페','카페');

--전라북도
insert into travelList values('전라북도','전주동물원','전북 전주시 덕진구 소리로 68 전주동물원','실외','테마공원','데바사키','일식당','모두가만두','만두','미스터리초밥','일식당');
insert into travelList values('전라북도','전주 한옥마을','전북 전주시 완산구 기린대로 99','실외','산책','커피랑카페','베이커리','전망대카페','카페','더플레이트','뷔페');
insert into travelList values('전라북도','광한루원','전북 남원시 요천로 1447','실외','산책','광한루','카페','예루원카페','베이커리','크레마노','베이커리');
insert into travelList values('전라북도','한국도로공사 전주수목원','전북 전주시 덕진구 번영로 462-45 전주수목원','실외','수목원','수목원카페','카페','플루800','카페','플래이닝','베이커리');
insert into travelList values('전라북도','변산해수욕장','전북 부안군 변산면 대항리 567','실외','바닷가','카페쿠숑','카페','경일','카페','변산파도','베이커리');
insert into travelList values('전라북도','군산근대역사박물관','전북 군산시 해망로 240','실내','관람','미즈','카페','황해동','카페','먹방이와 친구들','베이커리');
insert into travelList values('전라북도','임실치즈테마파크','전북 임실군 성수면 도인2길 50','실외','체험','프로마쥬','양식','루체른','카페','블루132','베이커리');
insert into travelList values('전라북도','선유도해수욕장','전북 군산시 옥도면 선유도리','실외','바닷가','할리스','카페','선유도','베이커리','빨간다리','포장마차');
insert into travelList values('전라북도','고창읍성','전북 고창군 고창읍 읍내리 125-9','실외','관람','메종오브','양식','포비스키친','양식','쑤기','카페');
insert into travelList values('전라북도','고창고인돌박물관','전북 고창군 고창읍 고인돌공원길 74 고인돌박물관','실외','관람','서래','카페','백일후애카페','베이커리','아산서해','양식');

-- 제주도
insert into travelList values('제주도','용머리해안','제주 서귀포시 안덕면 사계리 112-3','실외','산책','커피스케치','카페','원앤온리','카페','뷰스트','카페');
insert into travelList values('제주도','헬로키티아일랜드','제주 서귀포시 안덕면 한창로 340','실내','관람','뮤지엄','카페','무로이','베이커리','위이카페','카페');
insert into travelList values('제주도','함덕해수욕장','제주 제주시 조천읍 조함해안로 525','실외','바닷가','델문도','카페','스타벅스','카페','해녀','베이커리');
insert into travelList values('제주도','오설록 티 뮤지엄','제주 서귀포시 안덕면 신화역사로 15','실외','산책','스타벅스','카페','풀베개','카페','스모크하우스','양식');
insert into travelList values('제주도','아쿠아플라넷 제주','제주 서귀포시 성산읍 섭지코지로 95','실내','아쿠아리움','민트레스토랑','양식','서귀피안','베이커리','성산카페','브런치');
insert into travelList values('제주도','카멜리아힐','제주 서귀포시 안덕면 병악로 166','실외','수목원','위이카페','카페','토끼떡공방','카페','뮤지엄카페','베이커리');
insert into travelList values('제주도','스누피가든','제주 제주시 구좌읍 금백조로 930','실내','관람','블루보틀','카페','풍림다방','카페','고사리커피','베이커리');
insert into travelList values('제주도','이호테우해수욕장','제주 제주시 이호일동','실외','바닷가','쿠주제주','카페','168테우','카페','로스트앤헤븐','베이커리');
insert into travelList values('제주도','정방폭포','제주 서귀포시 칠십리로214번길 37','실외','폭포','폴린','카페','너븐카페','베이커리','서귀포','양식');
insert into travelList values('제주도','에코랜드 테마파크','제주 제주시 조천읍 번영로 1278-169','실외','테마공원','야윈카페','카페','우동카덴','일식당','말로카페','베이커리');

-- 충청남도
insert into travelList values('충청남도','독립기념관','충남 천안시 동남구 목천읍 독립기념관로 1 독립기념관','관람','실내','카페목천','카페','데이오프','카페','나레스','양식');
insert into travelList values('충청남도','청산수목원','충남 태안군 남면 연꽃길 70 충남 태안군 남면 신장리 18번지','실외','수목원','몽산포제빵소','베이커리','쿠덴','일식당','앤앤','양식');
insert into travelList values('충청남도','피나클랜드','충남 아산시 영인면 월선길 20-42','실외','수목원','카페드 피나클','카페','아산.12','베이커리','피트','카페');
insert into travelList values('충청남도','대천해수욕장','충남 보령시 신흑동','실외','바닷가','바다위에그린씨','양식','충청도카페','카페','Have it','베이커리');
insert into travelList values('충청남도','국립생태원','충남 서천군 마서면 금강로 1210','실외','산책','스무디킹','카페','그린브라우니','베이커리','에뜨왈','카페');
insert into travelList values('충청남도','외암민속마을','충남 아산시 송악면 외암민속길 5','실외','관람','사과나무','카페','제로웨이스트','카페','솔뫼장','베이커리');
insert into travelList values('충청남도','백제문화단지','충남 부여군 규암면 백제문로 455 백제문화단지','실외','관람','빈타이','베이커리','더봉반','일식당','1986','카페');
insert into travelList values('충청남도','국립공주박물관','충남 공주시 관광단지길 34 국립공주박물관','실내','관람','효정차향차','카페','어린왕자','카페','큐브','베이커리');
insert into travelList values('충청남도','공산성','충남 공주시 금성동 53-51','실외','산책','하루카페','카페','공주토실이','베이커리','밤마을','베이커리');
insert into travelList values('충청남도','천리포수목원','충남 태안군 소원면 천리포1길 187','실외','수목원','섬노을','카페','천만금','카페','천리','베이커리');

-- 충청북도
insert into travelList values('충청북도','청남대','충북 청주시 상당구 문의면 청남대길 646','실외','산책','포레스트','카페','호반레스토랑','양식','호수정원','카페');
insert into travelList values('충청북도','중앙탑사적공원','충북 충주시 중앙탑면 탑정안길 6','실외','산책','탑뷰','카페','중앙탑','베이커리','카페메모리아','카페');
insert into travelList values('충청북도','고수동굴','충북 단양군 단양읍 고수동굴길 8','실외','동굴','커피명가','카페','단양 흑마늘빵','베이커리','단양284','카페');
insert into travelList values('충청북도','청풍호반케이블카','충북 제천시 청풍면 문화재길 166','실외','케이블카','랑데뷰','카페','훈이네 마늘빵','베이커리','풍년','뷔페');
insert into travelList values('충청북도','천하스카이워크','충북 단양군 적성면 옷바위길 10','실외','산책','스카이라운지','카페','만남카페','베이커리','명가','카페');
insert into travelList values('충청북도','활옥동굴','충북 충주시 목벌안길 26','실외','동굴','활옥동굴카페','카페','수국여울','카페','전망대카페','카페');
insert into travelList values('충청북도','의림지','충북 제천시 모산동 241','실외','산책','삼동','일식당','낭만CAFE','카페','유알비','카페');
insert into travelList values('충청북도','문암생태공원','충북 청주시 흥덕구 문암동 122-2','실외','산책','아르떼 물들이다','카페','캠프레스','카페','릴라별','베이커리');
insert into travelList values('충청북도','명암저수지','충북 청주시 상당구 용담동 290','실외','산책','듀레','베이커리','스테이인터뷰','카페','할리스','카페');
insert into travelList values('충청북도','청풍호 관광 모노레일','충북 제천시 청풍면 청풍명월로 879-17','실외','산책','제천카페','카페','모단','카페','모노382','베이커리');

desc travelList;

select * from travelList;